# Taps
tap "bramstein/webfonttools"

# Core utilities
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "bash"
brew "bash-completion2"
brew "wget"
brew "gnupg"
brew "vim"
brew "grep"
brew "openssh"
brew "screen"
brew "php"
brew "gmp"

# Font tools
brew "woff2"

# Git
brew "git"
brew "git-lfs"

# Modern CLI tools
brew "gh"           # GitHub CLI
brew "fzf"          # Fuzzy finder
brew "ripgrep"      # Fast grep (rg)
brew "bat"          # Better cat with syntax highlighting
brew "eza"          # Modern ls replacement (formerly exa)
brew "git-delta"    # Better git diff
brew "fd"           # Fast find alternative
brew "tldr"         # Simplified man pages
brew "htop"         # Interactive process viewer
brew "jq"           # JSON processor
brew "yt-dlp"       # YouTube downloader
brew "zoxide"       # Smarter cd that learns your habits
brew "starship"     # Cross-shell prompt
brew "atuin"        # Shell history search + sync
brew "direnv"       # Per-directory environment variables
brew "zsh-autosuggestions"      # Fish-like inline suggestions
brew "zsh-syntax-highlighting"  # Real-time command validation

# Utilities
brew "netpbm"
brew "pngcheck"
brew "xpdf"
brew "xz"
brew "ack"
brew "duti"          # Set default apps for file types
brew "gs"
brew "imagemagick"
brew "lua"
brew "lynx"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id"
brew "tree"
brew "vbindiff"
brew "zopfli"

# Fonts (Nerd Font variants for terminal icons)
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-monaspace-nf"
cask "font-caskaydia-mono-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-geist-mono-nerd-font"

# Casks
cask "ghostty"      # Terminal emulator
cask "sublime-text" # Text editor
cask "nikitabobko/tap/aerospace"  # Tiling window manager
