# Taps
tap "bramstein/webfonttools"

# Core utilities
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "bash"
brew "bash-completion2"
brew "wget"
brew "gnupg"
brew "vim"
brew "grep"
brew "openssh"
brew "screen"
brew "php"
brew "gmp"

# Font tools
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"

# Git
brew "git"
brew "git-lfs"

# Modern CLI tools
brew "gh"           # GitHub CLI
brew "fzf"          # Fuzzy finder
brew "ripgrep"      # Fast grep (rg)
brew "bat"          # Better cat with syntax highlighting
brew "eza"          # Modern ls replacement (formerly exa)
brew "git-delta"    # Better git diff
brew "fd"           # Fast find alternative
brew "tldr"         # Simplified man pages
brew "htop"         # Interactive process viewer
brew "jq"           # JSON processor

# Utilities
brew "netpbm"
brew "pngcheck"
brew "xpdf"
brew "xz"
brew "ack"
brew "gs"
brew "imagemagick"
brew "lua"
brew "lynx"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id"
brew "tree"
brew "vbindiff"
brew "zopfli"

# Casks
cask "rectangle"    # Window management
